---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemTotalLength
source: html/2a27ab40-bb7c-7a04-90ef-668040e0489a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemTotalLength Property

"Total Bar Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemTotalLength { get; }
```